docs/reading-note/inside-c++-object-model-note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>深度探索C++对象模型笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">深度探索C++对象模型笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf8310e8">前言</a></li>
<li><a href="#org5b60101">第一章 关于对象</a>
<ul>
<li><a href="#orgd93d94e">1.1 C++对象模型</a></li>
<li><a href="#org113a193">1.3 对象的差异</a></li>
</ul>
</li>
<li><a href="#orgc7d8d82">第二章 构造函数语意学</a>
<ul>
<li><a href="#org2a3478a">2.1 默认构造函数</a></li>
<li><a href="#org273f128">2.2 拷贝构造函数</a></li>
<li><a href="#orgef25b49">2.4 成员初始化列表</a></li>
</ul>
</li>
<li><a href="#orgf46516b">第三章 data语意学</a>
<ul>
<li><a href="#org027e6f6">3.2 data member布局</a></li>
<li><a href="#org1529dc0">3.3 data member的存取</a></li>
</ul>
</li>
<li><a href="#org618a5f0">第四章 function 语义学</a>
<ul>
<li><a href="#org6fe962b">4.1 member的各种调用方式</a></li>
<li><a href="#org31e6bf7">4.2 虚函数的实现模型</a></li>
<li><a href="#org8da8d18">4.4 指向member function的指针</a></li>
<li><a href="#orgc3546c6">4.5 内联函数</a></li>
</ul>
</li>
<li><a href="#org8c698ad">第五章 构造、析构、拷贝语意学</a></li>
<li><a href="#org6c2147c">第六章 执行期语意学</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf8310e8" class="outline-2">
<h2 id="orgf8310e8">前言</h2>
<div class="outline-text-2" id="text-orgf8310e8">
<p>
有两个概念可以解释C++对象模型：
</p>
<ol class="org-ol">
<li>语言中直接支持面向对象程序设计的部分。</li>
<li>对于各种支持的低层实现机制。</li>
</ol>

<p>
C++ class的完整虚函数在编译时期就固定下来了。
</p>

<p>
虚函数调用并不是非要通过虚表进行实现。但是，目前所有编译器对于虚函数的实现方法都是使用各个class专属的虚表，大小固定，并且在程序执行前就构造好了。
</p>
</div>
</div>

<div id="outline-container-org5b60101" class="outline-2">
<h2 id="org5b60101">第一章 关于对象</h2>
<div class="outline-text-2" id="text-org5b60101">
<p>
与C语言相比，加上封装之后的布局成本并没有增加多少。
</p>

<p>
每个non-inline member function只会诞生一个函数实体，至于每个“拥有零个或一个定义”inline function则会在每个使用者（模块）身上产生一个函数实体。
</p>

<p>
C++ 在布局以及存取时间上的额外负担是由virtual引起，包括：
</p>
<ul class="org-ul">
<li>virtual function机制，用以支持一个有效率的“执行期绑定”。</li>
<li>virtual base class，用以实现“多次出现在继承体系中的base class，有一个单一而被共享的实体”。</li>
</ul>
</div>

<div id="outline-container-orgd93d94e" class="outline-3">
<h3 id="orgd93d94e">1.1 C++对象模型</h3>
<div class="outline-text-3" id="text-orgd93d94e">
<p>
在C++中，有两种class data member:static和nostatic。有三种class member function：static、nostatic和virutal。
</p>

<p>
简单对象模型的概念被用在“指向成员的指针”中。
</p>

<p>
表格驱动对象模型概念中的member function table称为支持virtual function的一个有效方案。
</p>

<p>
C++对象模型中，nostatic data member被配置在每一个class object之内，static data member则存放在所有class object之外。static 和nostatic function member也被放在所有的class object之外。virtual function通过两个步骤支持：
</p>
<ol class="org-ol">
<li>每个class 产生一堆指向virutal function的指针，放在被称为“虚表（vtbl）”的表格中。</li>
<li>每个class object 被添加一个指针，指向相关的虚表。该指针就是“虚指针（vptr）”。vptr的设定和重置都有每个class 的构造函数、析构函数和拷贝运算符自动完成。每个class所关联的type_info object（支持RTTI）也经由虚表指出，通常放在表格的第一个slot处。</li>
</ol>
</div>
</div>

<div id="outline-container-org113a193" class="outline-3">
<h3 id="org113a193">1.3 对象的差异</h3>
<div class="outline-text-3" id="text-org113a193">
<p>
class object需要的内存包括：
</p>
<ul class="org-ul">
<li>nonstatic data members的总和大小。</li>
<li>内存对齐增加的空间。</li>
<li>为支持virtual增加的大小。</li>
</ul>

<p>
为什么将子类的对象赋值给基类对象时候，基类的虚指针不会被覆盖？这是有编译器保证的：如果某个object含有一个或一个以上的vptrs，哪些vptrs的内容不会被base class object初始化或改变。
</p>
</div>
</div>
</div>

<div id="outline-container-orgc7d8d82" class="outline-2">
<h2 id="orgc7d8d82">第二章 构造函数语意学</h2>
<div class="outline-text-2" id="text-orgc7d8d82">
</div>
<div id="outline-container-org2a3478a" class="outline-3">
<h3 id="org2a3478a">2.1 默认构造函数</h3>
<div class="outline-text-3" id="text-org2a3478a">
<p>
只有在 <b>编译器需要</b> 的时候，才会合成默认构造函数。
</p>

<p>
在合成的默认构造函数中，只有基类对象和member class object会被初始化，其他说有的nostatic data member，都不会被初始化。
</p>
</div>
</div>

<div id="outline-container-org273f128" class="outline-3">
<h3 id="org273f128">2.2 拷贝构造函数</h3>
<div class="outline-text-3" id="text-org273f128">
<p>
拷贝构造函数调用时机：初始化，类对象作为参数，类对象作为返回值。
</p>

<p>
默认构造函数和默认拷贝构造函数只有在 <b>编译器需要</b> 的时候才会被合成。
</p>

<p>
只有nontrivial的实体才会被合成于程序之中。决定拷贝构造是否为trivial的标准在于class是否展现处所谓的bitwise copy semantics（位逐次拷贝）。
</p>

<p>
当编译器导入一个vptr到class之后，该class 就不再展现bitwise copy sematics了。
</p>
</div>
</div>

<div id="outline-container-orgef25b49" class="outline-3">
<h3 id="orgef25b49">2.4 成员初始化列表</h3>
<div class="outline-text-3" id="text-orgef25b49">
<p>
以下情况必须使用成员初始化列表：
</p>
<ul class="org-ul">
<li>初始化引用成员</li>
<li>初始化const成员</li>
<li>调用基类的构造函数，该构造函数带有参数。</li>
<li>调用类成员的构造函数，该构造函数带有参数</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf46516b" class="outline-2">
<h2 id="orgf46516b">第三章 data语意学</h2>
<div class="outline-text-2" id="text-orgf46516b">
<p>
<code>class X{};</code> 编译器会安插进去一个char。
</p>
</div>

<div id="outline-container-org027e6f6" class="outline-3">
<h3 id="org027e6f6">3.2 data member布局</h3>
<div class="outline-text-3" id="text-org027e6f6">
<p>
members排序只需符合“较晚出现的members在class object较高的地址。” member不一定连续排列，members的边界调整可能需要填补一些bytes。
</p>

<p>
vptr根据编译器的不同，可能放在member最后，也可能放在object最前面。
</p>
</div>
</div>

<div id="outline-container-org1529dc0" class="outline-3">
<h3 id="org1529dc0">3.3 data member的存取</h3>
<div class="outline-text-3" id="text-org1529dc0">
<p>
指向data member的指针，其offset值总是被加上1，这样可以使编译系统区分出“一个指向data member的指针，用以指出class 的第一个member” 和 “一个指向data member 的指针，没有指出任何member” 两种情况。
</p>

<p>
o.m 和o-&gt;m的区别在于m是否是从虚基类继承而来的。指针的具体类型只有在运行时候才知道，但是o.m编译的时候就可以确定。
</p>
</div>
</div>
</div>

<div id="outline-container-org618a5f0" class="outline-2">
<h2 id="org618a5f0">第四章 function 语义学</h2>
<div class="outline-text-2" id="text-org618a5f0">
</div>
<div id="outline-container-org6fe962b" class="outline-3">
<h3 id="org6fe962b">4.1 member的各种调用方式</h3>
<div class="outline-text-3" id="text-org6fe962b">
<p>
编译器内部已将“member函数实体”转换为对等的“nonmember函数实体”。非静态成员函数，参数列表第一项是this指针。
</p>

<p>
不同的编译器对member名字处理（mangling）的方法不一样。
</p>

<p>
虚函数 <code>ptr-&gt;member()</code> 将被内部转化为 <code>(*ptr-&gt;vptr[1](ptr))</code> 。 其中：
</p>
<ul class="org-ul">
<li>1是member函数在虚表中的索引值。</li>
<li>vptr名称也可能会被mangling，因为可能有多个vptrs。</li>
<li>第二个ptr表示this指针。</li>
</ul>


<p>
使用class 域操作明确调用虚函数会更有效率，其解析方式会和nonstatic function member 一样。
</p>

<p>
静态成员函数的主要特性就是它没有this指针。以下的次要特性统统根源于其主要特性：
</p>
<ul class="org-ul">
<li>不能直接存取其class中的非静态成员变量。</li>
<li>不能被声明为const、volatile和virtual。</li>
<li>不需要经过对象才能调用。</li>
</ul>


<p>
对静态成员函数去地址得到的其在内存中的位置。由于静态成员函数没有this指针，所以其地址的类型并不是一个“指向类成员函数”的指针，而是一个“非成员函数指针”。也就是：
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #00d7af;">void</span> <span style="color: #a1db00;">class</span>::<span style="color: #ffd700;">function</span>(){}
</pre>
</div>
<p>
取地址：
</p>
<div class="org-src-container">
<pre class="src src-c++">&amp;<span style="color: #a1db00;">class</span>::function();
</pre>
</div>
<p>
会得到一个数值，类型是 <code>void(*)()</code> ,而不是  <code>void (class::*)();</code>
</p>

<p>
由于静态成员函数没this指针，所以可以将其作为call back函数。
</p>
</div>
</div>

<div id="outline-container-org31e6bf7" class="outline-3">
<h3 id="org31e6bf7">4.2 虚函数的实现模型</h3>
<div class="outline-text-3" id="text-org31e6bf7">
<p>
虚函数的实现模型：每个class有一个虚表，内含该class中所有的虚函数的地址。每个object有一个虚指针（vptr），指向虚表。
</p>

<p>
但是如何保存指针（或引用）的类型信息的呢？
</p>

<p>
实现上，首先我们可以在每一个多态的class object身上增加两个members：
</p>
<ol class="org-ol">
<li>一个字符串或数字，表示class的类型。</li>
<li>一个指针，指向某表格，表格中带有程序的virtual function的执行期地址。</li>
</ol>

<p>
有两个问题：
</p>
<ol class="org-ol">
<li><p>
如何确定表格的内容？也就是虚函数的地址。
</p>

<p>
该地址是在编译期决定，此外，这一组地址是固定不变的，执行期间不能新增或替换。由于程序执行期间，表格的大小和内容都不会改变，所以其构建和存取都可以由编译器完全掌握，不需要执行期的任何接入。
</p></li>

<li><p>
如何从表格中查找虚函数的地址？
</p>

<p>
通过以下两个编译期步骤：
</p>
<ul class="org-ul">
<li>为了找到表格，每个class object被安插上一个由编译器内部产生的指针，指向该表格。</li>
<li>为找到函数地址，每个虚函数都指派一个表格索引。</li>
</ul></li>
</ol>

<p>
一个class只有一个虚表，每个虚表内包含对应类对象所有 <b>active virutal function</b> 函数实体的地址。这些 active virtual function 包括：
</p>
<ul class="org-ul">
<li>该class所定义的虚函数实体。它会改写可能存在基类虚函数实体。</li>
<li>继承自基类的函数实体。</li>
<li>纯虚函数实体。</li>
</ul>


<p>
多重继承带来的问题：“必须在执行期调整this指针”。使用thunk技术解决该问题。
</p>

<p>
多重继承之下，一个派生类内含有n个虚表，n表示基类数目。对于每个虚表，派生类对象都有对应虚指针（vptr）。虚指针在构造时候被设立初始值。
</p>

<p>
不要在虚基类中声明非静态成员变量。
</p>
</div>
</div>

<div id="outline-container-org8da8d18" class="outline-3">
<h3 id="org8da8d18">4.4 指向member function的指针</h3>
</div>

<div id="outline-container-orgc3546c6" class="outline-3">
<h3 id="orgc3546c6">4.5 内联函数</h3>
<div class="outline-text-3" id="text-orgc3546c6">
<p>
关键词inline（或者类声明中的成员函数或友元函数的定义）只是一项请求。编译器就认为它可以用一个表达式合理地将这个函数扩展开来，它就接受这个请求。 “合理的扩展”是指在某种层次上，其执行成本要比一般的函数调用及返回机制所带来的负荷低。
</p>

<p>
inline函数中，“会带来副作用的实际参数”，通常都需要引入临时对象。
</p>

<p>
inine函数中的局部变量，在加上有副作用的参数，可能会导致大量临时性对象的产生。
</p>
</div>
</div>
</div>

<div id="outline-container-org8c698ad" class="outline-2">
<h2 id="org8c698ad">第五章 构造、析构、拷贝语意学</h2>
</div>

<div id="outline-container-org6c2147c" class="outline-2">
<h2 id="org6c2147c">第六章 执行期语意学</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:55</p>
<p class="validation"></p>
</div>
</body>
</html>
